Documents/АктСнятияПоказанийТеплосчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АктСнятияПоказанийТеплосчетчика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктСнятияПоказанийТеплосчетчика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураПодача</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураОбратка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходТеплоносителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментальнаяМощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднеДневноеПотребление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТеплосчетчикаПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТеплосчетчикаТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемВодыПоТеплоСчетчикуПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемВодыПоТеплоСчетчикуТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаВода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПростояПредыдущие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПростояТекущие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыПростояРазница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктСнятияПоказанийТеплосчетчика/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаАктСнятияПоказанийТеплосчетчикаПоказанияПриборов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	КОНЕЦПЕРИОДА(АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЕдиницаИзмерения,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ВидТарифа,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Коэффициент,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаПоказания,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ЛицевойСчет,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Организация,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Здание,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Исполнитель,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Автор КАК Ответственный,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаЧасы,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуПредыдущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуТекущее,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаВода,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояПредыдущие,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояТекущие,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояРазница,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураПодача,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураОбратка,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.РасходТеплоносителя,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.МоментальнаяМощность,
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.СреднеДневноеПотребление
		 |ИЗ
		 |	Документ.АктСнятияПоказанийТеплосчетчика.ПоказанияПриборов КАК АктСнятияПоказанийТеплосчетчикаПоказанияПриборов
		 |ГДЕ
		 |	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаАктСнятияПоказанийТеплосчетчикаПоказанияПриборов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПоказанияПриборовУчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура Печать(МассивОбъектов,
	ПараметрыПечати,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСнятияПоказаний") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктСнятияПоказаний", "АктСнятияПоказаний", ПечатьДокумента(МассивОбъектов, ОбъектыПечати, "АктСнятияПоказаний"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьДокумента(ТекущийДокумент, ОбъектыПечати, ИмяМакета)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктСнятияПоказаний";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЕдиницаИзмерения,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуПредыдущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояПредыдущие,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета.ЗаводскойНомер КАК ЗаводскойНомер,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Здание КАК Здание,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета.Услуга КАК Услуга,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПриборУчета,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Исполнитель,
		|	КОНЕЦПЕРИОДА(АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Дата,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ПоказаниеТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаПоказания,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.НаработкаТеплосчетчикаТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаЧасы,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ОбъемВодыПоТеплоСчетчикуТекущее,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.РазницаВода,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояТекущие,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.ЧасыПростояРазница,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураПодача,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.ТемператураОбратка,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.РасходТеплоносителя,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.МоментальнаяМощность,
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка.Организация
		|ИЗ
		|	Документ.АктСнятияПоказанийТеплосчетчика.ПоказанияПриборов КАК АктСнятияПоказанийТеплосчетчикаПоказанияПриборов
		|ГДЕ
		|	АктСнятияПоказанийТеплосчетчикаПоказанияПриборов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Макет = Документы.АктСнятияПоказанийТеплосчетчика.ПолучитьМакет("АктСнятияПоказаний");
	ОбластьМакета = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	
	Для Каждого стр Из РезультатЗапроса Цикл
		Если стр.Услуга = Справочники.Услуги.НайтиПоКоду("Р00000106") Тогда
			ОбластьМакета.Параметры.Водомер = стр.ПоказаниеПредыдущее;
			ОбластьМакета.Параметры.ВодомерПосл = стр.ПоказаниеТекущее;
			ОбластьМакета.Параметры.ВодомерРазница = стр.РазницаПоказания;
		Иначе
			ОбластьМакета.Параметры.Дата = стр.Дата;
			ОбластьМакета.Параметры.Адрес = стр.Здание;
			ОбластьМакета.Параметры.НомерСчетчика = стр.ПриборУчета;
			ОбластьМакета.Параметры.Простой = стр.ЧасыПростояПредыдущие;
			ОбластьМакета.Параметры.Наработка = стр.НаработкаТеплосчетчикаПредыдущее;
			ОбластьМакета.Параметры.ЕдИзм = стр.ЕдиницаИзмерения;
			ОбластьМакета.Параметры.ТЕ = стр.ПоказаниеПредыдущее;
			ОбластьМакета.Параметры.ВодаТепло = стр.ОбъемВодыПоТеплоСчетчикуПредыдущее;
			ОбластьМакета.Параметры.Исполнитель = стр.Исполнитель;
			ОбластьМакета.Параметры.ПростойПосл = стр.ЧасыПростояТекущие;
			ОбластьМакета.Параметры.ПростойРазница = стр.ЧасыПростояРазница;
			ОбластьМакета.Параметры.НаработкаПосл = стр.НаработкаТеплосчетчикаТекущее;
			ОбластьМакета.Параметры.НаработкаРазница = стр.РазницаЧасы;
			ОбластьМакета.Параметры.ТЕпосл = стр.ПоказаниеТекущее;
			ОбластьМакета.Параметры.ТЕразница = стр.РазницаПоказания;
			ОбластьМакета.Параметры.ВодаТеплоПосл = стр.ОбъемВодыПоТеплоСчетчикуТекущее;
			ОбластьМакета.Параметры.ВодаТеплоРазница = стр.РазницаВода;
			ОбластьМакета.Параметры.Тподача = стр.ТемператураПодача;
			ОбластьМакета.Параметры.ТОбратка = стр.ТемператураОбратка;
			ОбластьМакета.Параметры.РасходТН = стр.РасходТеплоносителя;
			ОбластьМакета.Параметры.Мощность = стр.МоментальнаяМощность;
			ОбластьМакета.Параметры.Организация = стр.Организация;
		КонецЕсли;
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции
